[
  {
    "slug": "cahier-des-charges-sirh",
    "title": "Cahier des charges SIRH",
    "description": {
      "sections": {
        "presentation": "Ce cahier des charges est un travail réalisé dans le cadre de la validation du bloc de compétences \"Gestion de la relation client en ingénierie du logiciel\", au sein de mon mastère d'Expert en Ingénierie Logicielle.",
        "context": "Ce travail a été réalisé dans le contexte suivant :\n\nITGlobe Solutions est une entreprise spécialisée dans la vente en ligne de produits électroniques et technologiques, en Europe. Pour anticiper sa future expansion de marché vers l’Italie et les Pays-Bas, ITGlobe Solutions a reconnu nécessaire de réaliser un audit de son actuel SIRH (Système d’Information pour les Ressources Humaines), et il a été déterminé de fait qu’il repose sur trop de systèmes hétérogènes et de processus manuels.",
        "actors": "Puisqu'il s'agissait d'un travail individuel, je fus seul responsable de la conception du cahier des charges. La validation était quant à elle effectuée par un responsable du bloc de compétences évalué.",
        "work": "Pour parvenir à réaliser ce cahier des charges, j'ai d'abord pris le temps d'étudier la solution actuelle de l'entreprise et de la comparer aux objectifs qui étaient inscrits dans l'énoncé. Puis, j'ai étudié la portée du projet en prenant en compte les parties prenantes de la future plateforme SIRH, et j'ai fait une description pour chacun des besoins fonctionnels que j'ai pu identifier en amont.\n\nEnsuite, il fallait travailler sur l'architecture de l'application. Pour cela, j'ai réfléchi aux différetens architectures logicielles existantes et j'ai pris la décision de partir sur une architecture de micro-services, qui garantirait une meilleure scalabilité à l'application.\n\nEnfin, j'ai dressé une liste des besoins non fonctionnels, en étudiant les contraintes (technologiques, de sécurité, règlementaires, et d'interopérabilité avec le système existant), les risques du projet et les normes RGPD à appliquer.\n\nEt pour conclure, j'ai réalisé une étude comparative de solutions envisageables (intégration d'une plateforme SIRH existante, développement en interne, développement en externe), en comparant les avantages et les inconvenients de chacune d'elles (ressources engagées, respect des contraintes, respect des délais, etc.).",
        "results": "Mon étude de cas a reçu les félicitations du responsable du bloc de compétences, et j'ai pu obtenir en la validation.",
        "following": "Il n'y a aucune suite prévue pour ce projet.",
        "analysis": "J'ai toujours pensé que la rédaction d'un cahier des charges fonctionnel était un travail complexe, voire inatteignale pour moi, mais cette étude de cas a réussi à me prouver le contraire et j'en suis fier. Il est certain que je me baserai sur ce travail pour mes futurs projets, si le besoin en vient."
      }
    },
    "shortDescription": "Rédaction d'un cahier des charges fonctionnel sur l'implémentation d'un SIRH pour une société fictive.",
    "imageUrl": "/projects/edc-cahier-charges-fonctionnel.png",
    "gitUrl": "",
    "hostUrl": "",
    "date": "2025",
    "type": "UNIV",
    "etablissement": "iscod",
    "skills": [
      "communication",
      "critical-thinking",
      "active-listening",
      "organization",
      "rigor",
      "attention-to-details"
    ]
  },
  {
    "slug": "infras-map",
    "title": "Infras Map",
    "description": {
      "sections": {
        "presentation": "Infras Map est une application React utilisant la librairie Mapbox pour ajouter et éditer des coordonnées GPS dans un annuaire. Pour simplifier la gestion de ces coordonnées, elles sont stockées en LocalStorage.",
        "context": "Ce projet surgit dans une période où je cherchais à me former à de nouvelles technologies comme React, et à consolider mes acquis sur Tailwind et TypeScript.",
        "actors": "Aucun acteur à part moi-même n'a eu à intervenir sur le projet.",
        "work": "Cette application a été réalisé en une quinzaine d'heures de travail. L'idée a été en premier lieu d'intégrer Mapbox à l'interface et ensuite de travailler sur la gestion des données de l'annuaire. La finalité du projet était de le documenter, au travers d'un README.md détaillé.",
        "results": "L'application fonctionne bien, n'est certes pas hébergée, mais répond aux spécifications attendues.",
        "following": "L'application peut encore servir de base pour d'autres projets. Je pourrais aussi remplacer le stockage en LocalStorage par un stockage en base de données, avec une API en NestJS par exemple.",
        "analysis": "J'aime bien ce projet car j'y retrouve des points positifs (déjà l'utilisation des conventionnal commits en partie, une documentation et un code claires) et des points négatifs, comme ma naïveté sur la gestion du responsive d'une telle application, ou encore l'intégration d'un docker-compose (en plus du Dockerfile) que je ne saurai expliquer ! Point bonus sur le fait que j'ai attribué à React le titre de framework et non de bibliothèque."
      }
    },
    "shortDescription": "Projet React utilisant la librairie Mapbox pour créer/éditer un annuaire de coordonnées d'entreprises, en LocalStorage.",
    "imageUrl": "/projects/infras-map.jpg",
    "gitUrl": "https://github.com/TomPillet/infras-map",
    "hostUrl": "",
    "date": "2023",
    "type": "PERSO",
    "etablissement": "",
    "skills": [
      "react",
      "typescript",
      "tailwind",
      "docker",
      "git",
      "curiosity",
      "adaptability",
      "rigor"
    ]
  },
  {
    "slug": "newsletter-sign-up",
    "title": "Newsletter sign-up",
    "description": {
      "sections": {
        "presentation": "Ce projet est un travail personnel sur l'intégration d'une maquette d'un formulaire de souscription à une newsletter. La maquette du projet vient du site Frontend Mentor.",
        "context": "L'idée derrière ce projet était de tester mes compétences à développer des interfaces web sans passer par des biliothèques ou frameworks, avec donc du HTML, du CSS et du JS purs. Je voulais mesurer mes compétences de développeur frontend à réaliser des interfaces designs, modernes et responsives.",
        "actors": "Aucun acteur à part moi-même n'a eu à intervenir sur le projet.",
        "work": "Réalisé en quelques heures seulement, j'ai démarré ce projet par une étude des écrans de la maquette, en réfléchissant à la structure des composants et des interactions. Ensuite, j'ai commencé à coder la partie HTML et CSS, et enfin, j'ai ajouté la partie JS. Cette fois-ci, je n'ai pas cherché à documenter le projet par un README.md, mais j'ai laissé les fichiers de la maquette sur le git du projet.",
        "results": "L'application fonctionne comme attendue, avec un écran de formulaire, et un écran de succès d'inscription, le tout étant responsive et accessible.",
        "following": "Le projet en lui-même n'a pas de suite, mais je me vois bien réitérer ce genre d'exercices, peut-être cette fois en utilisant des ressources comme React et Chakra UI, ou d'autres.",
        "analysis": "C'est un projet pour lequel je suis content du résultat. J'ai pu faire des tests sur le design des composants et des interactions, et ça m'a permis de consolider mes connaissances de HTML, CSS et JS."
      }
    },
    "shortDescription": "Intégration d'une maquette d'un formulaire d'inscription à une newsletter, en HTML, CSS et JS seulement.",
    "imageUrl": "/projects/newsletter-sign-up.jpg",
    "gitUrl": "https://github.com/TomPillet/design_newsletter-sign-up",
    "hostUrl": "",
    "date": "2023",
    "type": "PERSO",
    "etablissement": "",
    "skills": [
      "javascript",
      "git",
      "curiosity",
      "rigor",
      "attention-to-details"
    ]
  },
  {
    "slug": "pal-pav",
    "title": "PalPav",
    "description": {
      "sections": {
        "presentation": "PalPav est une application web qui permet de partager ses livres, films et séries à lire ou voir. Son développement est en pause pour le moment.",
        "context": "Ce projet intervient suite à une envie de développer une solution qui permettrait de rechercher et de renseigner des livres, des films et des séries que je souhaite lire ou voir. En effet, étant de nature curieux et ouvert d'esprit, j'entends facilement parler de nombreux films, sériex et livres qui pourraient m'intéresser, et tous les noter au travers de mes notes de téléphone n'est pas pratique. De plus, PalPav doit pouvoir fonctionner comme un réseau social, avec des rédactions d'avis, des publications pour alimenter des débats, et un système de \"follow\" et d'amis. J'aimerai aussi que le projet soit installable sur téléphone, soit via une application téléchargeable sur un store, soit via une PWA.\n\nPar ailleurs, j'ai choisi de réaliser ce projet en Laravel pour creuser en profondeur cette technologie que je n'avais pas eu le temps d'aborder longuement lors de mon expérience de développeur au Crédit Agricole.",
        "actors": "Aucun acteur à part moi-même n'a eu à intervenir sur le projet.",
        "work": "J'ai commencé le projet par de longueus heures sur Figma à trouver le design qui me déciderait. J'ai donc conçu des moodboards, fait des tests de maquettes, et lorsque j'en ai eu assez, j'ai démarré la programmation de PalPav. J'ai conçu les premiers endpoints d'API, intégrées les premières vues et routes d'accès, mais je n'ai pas pris le temps de finir le projet depuis, et ai décidé de le mettre en pause pour le moment.",
        "results": "Les objectifs du projet ne sont pas atteints. Mais cela m'a permis d'aborder en autonomie quelques fonctionnalités de Laravel que je n'avais eu l'occasion de voir lors de mon expérience au Crédit Agricole.",
        "following": "Du moment que les objectifs du projet n'ont pas été rempli, il reste encore du travail à faire !",
        "analysis": "Bien qu'il reste beaucoup de choses à voir (et à revoir) sur ce projet, je suis content d'avoir mis en forme une idée que j'exprimais initialement comme un besoin. Cela m'a permis aussi de comprendre qu'il ne suffit pas d'avoir une expérience professionnelle pour se dire apte à concevoir des applications, car j'avais à l'époque encore quelques lacunes en développement web, notamment côté serveur."
      }
    },
    "shortDescription": "Plateforme pour organiser ses livres, films et séries à lire ou voir. Projet en pause pour l'instant.",
    "imageUrl": "/projects/pal-pav.jpg",
    "gitUrl": "https://github.com/TomPillet/pal-pav",
    "hostUrl": "",
    "date": "2023",
    "isActive": true,
    "type": "PERSO",
    "etablissement": "",
    "skills": [
      "laravel",
      "php",
      "tailwind",
      "git",
      "adaptability",
      "curiosity",
      "rigor",
      "attention-to-details"
    ]
  },
  {
    "slug": "pilotage-projet-logiciel",
    "title": "Pilotage projet logiciel",
    "description": {
      "sections": {
        "presentation": "Cette étude de cas de pilotage de projet logiciel est un travail réalisé dans le cadre de la validation du bloc de compétences \"Pilotage de projet d'ingénierie du logiciel\", au sein de mon mastère d'Expert en Ingénierie Logicielle.",
        "context": "Dans cette étude de cas, on joue le rôle du chef de projet de la start-up O'Fit spécialisée dans le développement d'applications de santé connectée. L'entreprise vise à lancer une nouvelle application mobile qui aide les utilisateurs à gérer et améliorer leur santé à travers un suivi complet de leur activité physique, alimentation, et sommeil.\n\nDans ce contexte, il nous a alors été confié la réalisation d'un audit d'architecture logicielle de l'application, tout en professionnalisant l'organisation du travail de l'équipe du projet. Les objectifs clés de la future application sont de rendre l'application intuitive et engageante, de sécuriser et garantir la confidentialité des données personnelles, d'innover et de proposer des fonctionnalités de personnalisation de l'application.",
        "actors": "Puisqu'il s'agissait d'un travail individuel, je fus seul responsable de la conception du cahier des charges. La validation était quant à elle effectuée par un responsable du bloc de compétences évalué.",
        "work": "Pour débuter ce projet, j'ai écrit un premier document de spécifications des fonctionnalités. Dedans, j'ai listé et détaillé les fonctionnalités nécessaires à la réalisation d'un MVP, puis je les ai priorisées en fonction de leur importance et de leur influence sur l'application par rapport aux autres.\n\nEnsuite, j'ai rédigé un second document : le rapport d'indicateur et d'analyse des risques. Dedans on y trouve donc l'identification et la définition des risques potentiels du projet, un tableau avec leur criticté (définie à l'aide d'une matrice des risques), un plan de mitigation de ces risques, et une liste d'indicateurs d'avancement du projet.\n\nEnfin, le dernier document constituait l'audit et le plan d'amélioration de l'environnement de travail, car le directeur de l'entreprise avait eu écho de problèmes d'organisation et de communication au sein de l'équipe du projet. Ce document donc comprend un audit de l'envionnrement de travail, et propose des axes d'améliorations (le plan d'action).",
        "results": "Cette étude de cas a reçu les félicitations du responsable, et j'ai pu ainsi valider le bloc de compétences associé.",
        "following": "Il n'y a aucune suite prévue pour ce projet.",
        "analysis": "Je suis très satisfait du résultat de cette étude de cas. Elle m'a permis d'y voir clair dans les pratiques de pilotage de projet, la complexité que cela représente et la nécessité d'avoir de l'expérience dans les métiers abordés pour plus mener à bien un projet logiciel."
      }
    },
    "shortDescription": "Rédaction de documents de pilotage du développement d'une future application de montre connectée.",
    "imageUrl": "/projects/edc-pilotage-projet-logiciel.jpg",
    "gitUrl": "",
    "hostUrl": "",
    "date": "2025",
    "type": "UNIV",
    "etablissement": "iscod",
    "skills": [
      "adaptability",
      "critical-thinking",
      "active-listening",
      "organization",
      "rigor"
    ]
  },
  {
    "slug": "audit-architecture-logicielle",
    "title": "Audit architecture logicielle",
    "description": {
      "sections": {
        "presentation": "Cet audit d'architecture logicielle est une étude de cas collective, réalisée en binôme, dans le cadre de la validation du bloc de compétences \"Conception avancée de l'architecture de logiciel\", au sein de mon mastère d'Expert en Ingénierie Logicielle.",
        "context": "Dans le contexte de cette étude de cas, nous avons été contacté pour rédiger quatre documents visant à accompagner et faciliter la modernisation d'une application de complex scolaire : School Manager. En effet, le client avait besoin d'experts pour rédiger un rapport d'audit sur la solution existante, un document de recommendations, un document d'architecture logicielle et une feuille de route de migration (renseignant les détails d'une telle évolution).\n\nLes objectifs finaux du projet étaient la migration du système actuel de l'école vers un système performant, robuste et maintenable, la mise en place d'une architecture moderne (la solution pré-existante tournait sur une architecture monolithique), et la simplification du déploiement, des tests et de l'intégration continue de sorte à augmenter la scalabilité et les capacités d'adaptation de l'application du SI.",
        "actors": "Il s'agissait d'une étude de cas collective, réalisée en binôme avec un camarade de formation. La validation était effectuée par un jury spécialiste du bloc de compétences évalué.",
        "work": "En premier lieu, nous avons tous les deux pris connaissance du sujet et lu attentivement la demande du client. Puis, nous avons décidé de séparer la charge de travail en deux : mon camarade avait à charge la rédaction de la feuille de route de migration et du document de recommendation, et moi je me suis occupé de rédiger le rapport d'audit et le document d'architecture.\n\nPour le rapport d'audit, j'ai commencé par rappeler le contexte du projet, puis j'ai défini la portée de cet audit. J'ai ensuite listé et détaillé les nouveaux objectifs du SI. Il ne restait enfin plus qu'à analyser l'architecture existante, en dressant une liste d'avantages et d'inconvénients.\n\nPour le document d'architecture, j'ai commencé par rappeler les objectifs du projet et par schématiser l'architecture du SI existant. Puis, j'ai proposé une nouvelle architecture (que nous avions validé avec mon camarade), schématisée aussi, avec un diagramme de classe pour la base de données qui devait inclure de nouvelles tables par rapport au SI existant. Enfin, il ne restait plus qu'à justifier notre choix d'architecture.\n\nLorsque nous avions chacun fini un document, nous prenions une pause de 5-10 minutes pour consulter le travail de l'autre et pour discuter des points de vue et des choix de chacun.",
        "results": "Cette étude de cas a été validé par le jury, nous permettant de valider le bloc de compétences associé.",
        "following": "Il n'y a aucune suite prévue pour ce projet.",
        "analysis": "C'était une étude de cas intéressante, d'autant qu'elle nous a demandé de réaliser ces documents dans un temps imparti. De plus, cela nous a permis à chacun de cibler les particularités que cela engage que de travailler à deux sur des documents d'architecture de logiciel, la majorité des travaux du genre se faisant en individuel à l'université."
      }
    },
    "shortDescription": "Rédaction de documents d'audit d'une architecture logicielle d'un complex scolaire.",
    "imageUrl": "/projects/edc-archi-logicielle.jpg",
    "gitUrl": "",
    "hostUrl": "https://drive.google.com/drive/folders/1znF5SLMi0ZGtIqfkADxVAjjvZsfArVgr?usp=sharing",
    "date": "2025",
    "type": "UNIV",
    "etablissement": "iscod",
    "skills": [
      "team-work",
      "communication",
      "critical-thinking",
      "active-listening",
      "organization",
      "rigor"
    ]
  }
]
